In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.rand(5,2), columns=["A","B"])
df

          A         B
0  0.188926  0.132166
1  0.995958  0.472430
2  0.142343  0.970530
3  0.475308  0.066003
4  0.481692  0.901632

In [3]:
df["A"]<0.5

0     True
1    False
2     True
3     True
4     True
Name: A, dtype: bool

In [4]:
df['A']>0.3

0    False
1     True
2    False
3     True
4     True
Name: A, dtype: bool

In [6]:
df[(df['A']<0.5)&(df['B']>0.3)]

          A         B
2  0.142343  0.970530
4  0.481692  0.901632

In [8]:
df.query('A<0.5 and B>0.3') #위와 같은 결과를 보이는 명령어

          A         B
2  0.142343  0.970530
4  0.481692  0.901632

In [14]:
df=pd.DataFrame({
    'animal' : ["dog", "cat", "cat", "pig", "cat"],
    'name' : ["Happy", "Sam", "Toby", "Mini", "Rocky"]
    
})

df

  animal   name
0    dog  Happy
1    cat    Sam
2    cat   Toby
3    pig   Mini
4    cat  Rocky

In [15]:
df.animal.str.contains('cat')

0    False
1     True
2     True
3    False
4     True
Name: animal, dtype: bool

In [16]:
df[df.animal.str.contains('cat')] #cat이 담겨있는 것을 뽑기

  animal   name
1    cat    Sam
2    cat   Toby
4    cat  Rocky

In [17]:
df[df.animal.str.match('cat')] 
#단어 'cat'과 맞는 것을 뽑기. ex. cat_black 같은것도 뽑음

  animal   name
1    cat    Sam
2    cat   Toby
4    cat  Rocky

In [19]:
df=pd.DataFrame(np.arange(5),columns=["Num"])
def square(x):
    return x**2
df["Num"].apply(square)
df["Square"]=df.Num.apply(lambda x:x**2)
df

   Num  Square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [20]:
df["Num"]

0    0
1    1
2    2
3    3
4    4
Name: Num, dtype: int32

In [21]:
df["Num"].apply(square)

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [23]:
df.Num.apply(lambda x : x**2)

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [25]:
df = pd.DataFrame(columns=["phone"])
df.loc[0] = "010-1234-1235"
df.loc[1] = "공일공-일이삼사-1235"
df.loc[2] = "010.1234.일이삼오"
df.loc[3] = "공1공-1234.1이3오"
df["preprocess_phone"] = ''
df

           phone preprocess_phone
0  010-1234-1235
1  공일공-일이삼사-1235
2  010.1234.일이삼오
3  공1공-1234.1이3오

In [27]:
def get_preprocess_phone(phone):
    mapping_dict = {
    "공": "0",
    "일": "1",
    "이": "2",
    "삼": "3",
    "사": "4",
    "오": "5",
    "-": "",
    ".": "",
    }
    for k,v in mapping_dict.items(): #k=key, v=values 약어
        phone=phone.replace(k,v)
    return phone

In [29]:
df["preprocess_phone"]=df['phone'].apply(get_preprocess_phone)
#df["preprocess_phone"]이거에 df['phone']이거에 있는 것을 apply(get_preprocess_phone) 선언한 전환 내용들 적용하는 것.
df

           phone preprocess_phone
0  010-1234-1235      01012341235
1  공일공-일이삼사-1235      01012341235
2  010.1234.일이삼오      01012341235
3  공1공-1234.1이3오      01012341235

In [33]:
 df.to_csv("df_ex1.csv".encoding='cp949')

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (<ipython-input-33-9917296fcdc2>, line 1)

In [35]:
df = pd.DataFrame([0,0,1,1,0],columns=['sex'])
print(df,'\n')

   sex
0    0
1    0
2    1
3    1
4    0

In [36]:
df.sex.replace({0:'Male', 1: 'Female'})

0      Male
1      Male
2    Female
3    Female
4      Male
Name: sex, dtype: object

In [37]:
df

   sex
0    0
1    0
2    1
3    1
4    0

In [38]:
df.sex.replace({0:'male', 1:'female'}, inplace=True)

In [39]:
df

      sex
0    male
1    male
2  female
3  female
4    male

In [46]:
df = pd.DataFrame({'key' : ['a','b','c','a','b','c'], 'data':range(6)})
#판다스에 데이터프레임으로 만들고 키를 정함. 딕셔너리 a,b,c,a,b,c 묶고 리스트 벨류값으로 묶고 데이타 레인지 함수로 받음 :6 
df.groupby('key')
df.groupby('key').sum()
df.groupby(['key','data1']).sum()

KeyError: 'data1'